posts/cet-ting-their-lives.org
#+BEGIN_COMMENT
.. title: CET-ting their Lives??!!
.. date: 2007-05-18 09:22:00
.. tags: , blab, hyderabad
.. slug: cet-ting-their-lives
#+END_COMMENT




Phew! I'm back home after one of my worst semesters so far. [there
have been only 4 upto now!! :P] {Also, not one of the better ones
grades-wise, but otherwise?? anyways.. forget it.. } From today
on, the lives of 2,27,483 young boys and girls [with the exception
of a few thousands] (in that part of the World called Andhra
Pradesh) will never be the same again. The so called verdict on
their lives (yes, the verdict of their lives!!) has been
pronounced at 11:45am today. EAMCET-07 [Engineering, Agriculture
and Medicine Common Entrance Test] results announced. This is no
more a matter of anxious students checking out, how they fared in
comparison to others of their age. It's no more a matter of
getting into Under-grad to come out a Grad in a chosen discipline.

"The Hottest Topic" in town. Nobody's left out of it. Young or
Old, Rich or Poor, Stout or Slim, Tall or Short, Theist or
Atheist, Engineers or Doctors, Black or White. "Black or White"??
How could I and those around me be left out?

Here's a little from what i see... [Is a little exaggeration
allowed?]

- An ad on the FM... "ee karyakramanni
  samarpinchindi... engineering vijethala mata.. bata.. Sri
  chaitanya.." [This programme is brought to you by... Sri
  Chaitanya.. the voice and choice of Engineering Winners!!]
- Another ad. Neti EAMCET phalitalalo kooda atyuttamaina vijayala
  tho... Narayana.. [With the most wonderful victories even in
  this time's EAMCET, Narayana] {Sri Chaitanya and Narayana are
  two very popular Junior Colleges here.. with hazaar
  franchises.. all over the State}
- A : How did your neighbor's cousin's friend's daughter's friend
  do? [ob exaggerated] B : She didn't do quite well. It seems she
  didn't study the I yr syllabus properly!! {How did he ever get
  to know that?!!?!?}
- Me : Where's A? Why's he so late? J.H : His sister's Medicine
  results are out. She scored 700! A local rank of 10! She'll get
  into any place she chooses. Me : That's cool. So that guys gone
  for a party or what? J.H : No he's consoling his sister! She's
  weeping for she expect to score a rank close to 300! Me : Oh
  c'mon!!

Why the hell is the whole state dragged into this? Can't the guys
n gals be left alone? Why is that a little thing as a test that
allocates various grad seats to the students, blown out of
proportion? Do we need big Corporate giants fighting for the ranks
and cash of aspiring students? Why all the hue and cry??

Isn't is possible for these people to have a normal life, where
these CET's are just a part of their lives and not their LIVES
themselves? Can't they be doing other things along with preparing
to get into a good grad school? Do we wish to have Engineers and
Doctors who, all through the best couple of years of their lives,
were busy grinding, swallowing and puking out heaps and heaps of
books just to get one seat in a Grad School?

Will things ever be normal again? When will kids "here" start
being kids? When will the parents and teachers and all the zillion
others understand that their kids need to be given everything in
life, exposed to everything. Not just dumping in gallons of
formulae and tons of equations. Will people ever give CETs just
that much attention as it deserves, and not make it a big issue
all over the state? When will the EAMCET stop being the lives of
college students and start being just a part of their lives??

[I have tried my best to portray the situation, in this part of
the World. But it is quite possible that I didn't do it well
enough....]


#+begin_quote
Every time you wake up and ask yourself, What good things am I
going to do today? Remember that when the sun goes down at sunset
it will take a part of your life with it -- Douglas Adams
#+end_quote

#+begin_quote
Adapt yourself to the things among which your lot has been cast
and love sincerely the fellow creatures with whom destiny has
ordained that you shall live. -- Richard Bach
#+end_quote
