output/posts/cet-ting-their-lives.html
<!DOCTYPE html><html lang="en">
<head>
    
    <meta charset="utf-8">
    <meta name="description" content="">
    <meta name="author" content="punchagan">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>CET-ting their Lives??!! | Noetic Nought</title>
    
            <link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
    <!--[if lt IE 9]>
    <![endif]-->
            <link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">

    



    
</head>

<body>
    <section class="social">
        <ul>
<!--        <h1 id="blog-title">
            <a href="/" title="Noetic Nought">Noetic Nought</a>
        </h1>
        
         -->
        
            <li><a href="../index.html" title="Home"><i class="icon-home"></i></a></li>
            <li><a href="../archive.html" title="Archives"><i class="icon-folder-open-alt"></i></a></li>
            <li><a href="../categories/index.html" title="Tags"><i class="icon-tags"></i></a></li>
            <li><a href="../rss.xml" title="RSS"><i class="icon-rss"></i></a></li>
            <li><a href="https://twitter.com/punchagan" title="Twitter profile"><i class="icon-twitter"></i></a></li>
            <li><a href="https://github.com/punchagan" title="GitHub profile"><i class="icon-github"></i></a></li>

<!--         -->
        </ul>
    </section>
    <section class="page-content">
        <div class="content" rel="main">
            
    <div class="post">
    
    <h1>CET-ting their Lives??!!</h1>

        <div class="meta">
            <div class="authordate">
                <time class="timeago" datetime="2007-05-18T09:22:00">2007-05-18 09:22</time>
            </div>
            

            
          |  
        <a href="cet-ting-their-lives.org" id="sourcelink">Source</a>

            
    <div class="tags">
        <ul>
        More posts about:  
            <li><a class="tag" href="../categories/blab.html">blab</a></li>
            <li><a class="tag" href="../categories/hyderabad.html">hyderabad</a></li>
        </ul>
    </div>

        </div>
        <div class="body">
            <p>
Phew! I'm back home after one of my worst semesters so far. [there
have been only 4 upto now!! :P] {Also, not one of the better ones
grades-wise, but otherwise?? anyways.. forget it.. } From today
on, the lives of 2,27,483 young boys and girls [with the exception
of a few thousands] (in that part of the World called Andhra
Pradesh) will never be the same again. The so called verdict on
their lives (yes, the verdict of their lives!!) has been
pronounced at 11:45am today. EAMCET-07 [Engineering, Agriculture
and Medicine Common Entrance Test] results announced. This is no
more a matter of anxious students checking out, how they fared in
comparison to others of their age. It's no more a matter of
getting into Under-grad to come out a Grad in a chosen discipline.
</p>

<p>
"The Hottest Topic" in town. Nobody's left out of it. Young or
Old, Rich or Poor, Stout or Slim, Tall or Short, Theist or
Atheist, Engineers or Doctors, Black or White. "Black or White"??
How could I and those around me be left out?
</p>

<p>
Here's a little from what i see… [Is a little exaggeration
allowed?]
</p>

<ul class="org-ul">
<li>An ad on the FM… "ee karyakramanni
samarpinchindi… engineering vijethala mata.. bata.. Sri
chaitanya.." [This programme is brought to you by… Sri
Chaitanya.. the voice and choice of Engineering Winners!!]
</li>
<li>Another ad. Neti EAMCET phalitalalo kooda atyuttamaina vijayala
tho… Narayana.. [With the most wonderful victories even in
this time's EAMCET, Narayana] {Sri Chaitanya and Narayana are
two very popular Junior Colleges here.. with hazaar
franchises.. all over the State}
</li>
<li>A : How did your neighbor's cousin's friend's daughter's friend
do? [ob exaggerated] B : She didn't do quite well. It seems she
didn't study the I yr syllabus properly!! {How did he ever get
to know that?!!?!?}
</li>
<li>Me : Where's A? Why's he so late? J.H : His sister's Medicine
results are out. She scored 700! A local rank of 10! She'll get
into any place she chooses. Me : That's cool. So that guys gone
for a party or what? J.H : No he's consoling his sister! She's
weeping for she expect to score a rank close to 300! Me : Oh
c'mon!!
</li>
</ul>

<p>
Why the hell is the whole state dragged into this? Can't the guys
n gals be left alone? Why is that a little thing as a test that
allocates various grad seats to the students, blown out of
proportion? Do we need big Corporate giants fighting for the ranks
and cash of aspiring students? Why all the hue and cry??
</p>

<p>
Isn't is possible for these people to have a normal life, where
these CET's are just a part of their lives and not their LIVES
themselves? Can't they be doing other things along with preparing
to get into a good grad school? Do we wish to have Engineers and
Doctors who, all through the best couple of years of their lives,
were busy grinding, swallowing and puking out heaps and heaps of
books just to get one seat in a Grad School?
</p>

<p>
Will things ever be normal again? When will kids "here" start
being kids? When will the parents and teachers and all the zillion
others understand that their kids need to be given everything in
life, exposed to everything. Not just dumping in gallons of
formulae and tons of equations. Will people ever give CETs just
that much attention as it deserves, and not make it a big issue
all over the state? When will the EAMCET stop being the lives of
college students and start being just a part of their lives??
</p>

<p>
[I have tried my best to portray the situation, in this part of
the World. But it is quite possible that I didn't do it well
enough….]
</p>


<blockquote>
<p>
Every time you wake up and ask yourself, What good things am I
going to do today? Remember that when the sun goes down at sunset
it will take a part of your life with it – Douglas Adams
</p>
</blockquote>

<blockquote>
<p>
Adapt yourself to the things among which your lot has been cast
and love sincerely the fellow creatures with whom destiny has
ordained that you shall live. – Richard Bach
</p>
</blockquote>
        </div>
        
    <ul class="pager">
        <li class="previous">
            <a href="alone.html">← Previous post</a>
        </li>
        <li class="next">
            <a href="summer-or-awe-tem-whatever-forever.html">Next post →</a>
        </li>
    </ul>

            
        
        <div id="disqus_thread"></div>
        <script type="text/javascript">
        var disqus_shortname ="rusticreverie";
            var disqus_url="http://punchagan.muse-amuse.in/posts/cet-ting-their-lives.html";
        var disqus_title="CET-ting their Lives??!!";
        var disqus_identifier="cache/posts/cet-ting-their-lives.html";
        var disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">Comments powered by <span class="logo-disqus">Disqus</span></a>


        

    </div>

            © 2013
<a href="mailto:punchagan%5B@T%5Dmuse-amuse.in">punchagan</a> -
<a href="http://getnikola.com">Nikola</a> powered -

<a rel="license" href="http://creativecommons.org/licenses/by/3.0/deed.en_US">
Creative Commons Attribution 3.0 Unported License</a>
 -
<a href="http://themes.getnikola.com/#zen">zen</a> theme
            
	

        </div>
    </section>
    
            <script src="../assets/js/all-nocdn.js" type="text/javascript"></script>

    
        <script type="text/javascript">
            $(function(){
                $('.timeago').timeago();
            });
        </script>
    
    <script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-21111013-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>

</body>
</html>